

const About: React.FC = () => {
    return (
        <>
        <div className="about container">
            <h1 className='title-main'>О КОМПАНИИ</h1>
            <div className="about-img">
                <img src="../../public/about-company.jpg" alt=""/>
            </div>
            <article className="about-text">
                <p>Компания «Essense House» основана с целью предоставления полного комплекса услуг по строительству домов под ключ, предлагая клиентам комфорт, надежность и качество на каждом этапе. Мы строим дома из современных и традиционных материалов, таких как пеноблоки, кирпич, клееный брус и оцилиндрованное бревно.</p>
                <p>Наша компания берет на себя все этапы строительства — от создания проекта и закладки фундамента до отделки и подключения инженерных систем. При этом мы можем как предложить готовые решения, так и реализовать проекты, разработанные вашими архитекторами или дизайнерами.</p>

                <p>Наши преимущества:</p>

                <ul className="about-list text-main">
                    <li>
                        Опытные специалисты. Наши сотрудники обладают многолетним опытом и регулярно повышают свою квалификацию, следя за новейшими технологиями и тенденциями в строительстве.
                    </li>
                    <li>
                        Долговечность и надежность. Наши дома рассчитаны на эксплуатацию более 100 лет благодаря качественным материалам и внимательному подходу к каждому этапу строительства.
                    </li>
                    <li>
                        Прозрачность и ответственность. Мы заключаем официальные договоры, предоставляем четкую и прозрачную смету, соблюдаем сроки и следим за тем, чтобы проект укладывался в утвержденный бюджет.
                    </li>
                    <li>
                        Индивидуальный подход. Мы внимательно выслушиваем все пожелания клиентов, стремимся предлагать гибкие решения и гарантируем максимальное удовлетворение от результата.
                    </li>
                </ul>

                <p>Доверяя нам строительство вашего дома, вы получаете не только качественное исполнение, но и уверенность в том, что дом будет радовать вас и ваши будущие поколения на протяжении многих лет.</p>
            </article>
        </div>
        <div className="history container">
            <h3 className="subtitle-main">ИCТОРИЯ СТАНОВЛЕНИЯ КОМПАНИИ</h3>
            <div className='history-list'>
                <div className='history-item'>
                    <div className='history-content'>
                        <span className='year'>2018</span>
                        <article className="history-item__text">
                            <h3>Первый шаг на рынке: ремонт и отделочные работы с небольшой командой.</h3>
                            <p>
                                Essense House была основана в 2015 году, начиная с небольших строительных и ремонтных
                                проектов. В команде было всего 10 человек, но благодаря упорству и стремлению к
                                качеству, мы быстро завоевали доверие первых клиентов. Нашей миссией с самого начала
                                было строительство домов, которые станут воплощением уюта и комфорта для каждой
                                семьи.
                            </p>
                        </article>
                    </div>
                    <div className='history-img'>

                    </div>
                </div>
                <div className='history-item'>
                    <div className='history-content'>
                        <span className='year'>2019</span>
                        <article className="history-item__text">
                            <h3>Старт строительной деятельности</h3>
                            <p>
                                Компания начала расти. Мы расширили перечень услуг, включив в него проектирование
                                индивидуальных домов, а также начали работать с новыми строительными материалами,
                                включая кирпич и пеноблоки. Наш штат увеличился до 20 специалистов, и мы приступили к
                                реализации первых крупных заказов. Этот год стал переломным — мы получили первые заказы
                                на строительство загородных домов под ключ.
                            </p>
                        </article>
                    </div>
                    <div className='history-img'>

                    </div>
                </div>
                <div className='history-item'>
                    <div className='history-content'>
                        <span className='year'>2020-2021</span>
                        <article className="history-item__text">
                            <h3>Эра масштабного роста</h3>
                            <p>
                                Essense House расширила географию своей работы, возводя дома не только в пределах одного региона, но и по всей стране. Мы построили более 50 домов, в том числе первые каркасные дома. Число наших сотрудников выросло до 60 человек, а компания стала известна как надежный партнер, который всегда придерживается сроков и высокого стандарта качества. Также начались работы над дополнительными постройками — банями и беседками.
                            </p>
                        </article>
                    </div>
                    <div className='history-img'>

                    </div>

                </div>
                <div className='history-item'>
                    <div className='history-content'>
                        <span className='year'>2021-2024</span>
                        <article className="history-item__text">
                            <h3>Период инноваций и расширения</h3>
                            <p>
                                Мы открыли собственное проектное бюро и разработали несколько уникальных проектов домов, которые пользовались огромной популярностью среди клиентов. Наша команда пополнилась архитекторами и дизайнерами, что позволило нам реализовывать все более амбициозные проекты. В 2022 году нами было построено свыше 100 домов различных типов, от кирпичных до домов из клееного бруса.
                                Компания продолжает развиваться и расти. К концу 2023 года нами было построено и сдано более 200 домов и коттеджей. Мы начали строить дома по новым современным технологиям с использованием модульных конструкций и возобновляемых источников энергии. В наших проектах мы все чаще применяем индивидуальные решения для каждого клиента, начиная с выбора материала и заканчивая дизайном интерьера. Наш принцип остается неизменным — строить дома, которые служат не одному поколению, создавая уют и безопасность для каждой семьи.

                            </p>
                        </article>
                    </div>
                    <div className='history-img'>
                        <img src="https://static2.banki.ru/ugc/98/de/ff/27/10985696.jpg" alt=""/>
                    </div>

                </div>
            </div>
        </div>
        </>
    )
}

export default About